marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcu_TS_T40D2M10I1R0/include/Reg_eSys_PMC.h
/**
*   @file    Reg_eSys_PMC.h
*   @version 1.0.1
*
*   @brief   AUTOSAR Mcu - Macros for memory access.
*   @details Macros/Defines used for registry and memory read/write.
*
*   @addtogroup MCU
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.2 MCAL
*   Platform             : ARM
*   Peripheral           : MC
*   Dependencies         : none
*
*   Autosar Version      : 4.2.2
*   Autosar Revision     : ASR_REL_4_2_REV_0002
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K14x_MCAL_1_0_1_RTM_HF1_ASR_REL_4_2_REV_0002_20180723
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017-2018 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/


#ifndef REG_ESYS_PMC_H
#define REG_ESYS_PMC_H


#ifdef __cplusplus
extern "C"{
#endif


/**
* @page misra_violations MISRA-C:2004 violations
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*
* @section Reg_eSys_PMC_h_REF_1
* Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined
* This violation is due to function like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
*/


/*==================================================================================================
                                         INCLUDE FILES
 1) system and project includes
 2) needed interfaces from external units
 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Reg_eSys.h"
#include "Mcu_PMC_IPVersion.h"

/*==================================================================================================
                               SOURCE FILE VERSION INFORMATION
==================================================================================================*/

#define REG_ESYS_PMC_VENDOR_ID                       43
#define REG_ESYS_PMC_AR_RELEASE_MAJOR_VERSION        4
#define REG_ESYS_PMC_AR_RELEASE_MINOR_VERSION        2
#define REG_ESYS_PMC_AR_RELEASE_REVISION_VERSION     2
#define REG_ESYS_PMC_SW_MAJOR_VERSION                1
#define REG_ESYS_PMC_SW_MINOR_VERSION                0
#define REG_ESYS_PMC_SW_PATCH_VERSION                1


/*==================================================================================================
                                      FILE VERSION CHECKS
==================================================================================================*/
/* Check if current file and Reg_eSys header file are of the same version */
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
    #if ((REG_ESYS_PMC_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
         (REG_ESYS_PMC_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION) \
        )
        #error "AutoSar Version Numbers of Reg_eSys_PMC.h and Reg_eSys.h are different"
    #endif
#endif

/* Check if source file and Mcu_PMC_IPVersion header file are from the same vendor */
#if (REG_ESYS_PMC_VENDOR_ID != MCU_PMC_IPVERSION_VENDOR_ID)
    #error "Reg_eSys_PMC.h and Mcu_PMC_IPVersion.h have different vendor ids"
#endif
/* Check if source file and Mcu_PMC_IPVersion header file are of the same Autosar version */
#if ((REG_ESYS_PMC_AR_RELEASE_MAJOR_VERSION != MCU_PMC_IPVERSION_AR_RELEASE_MAJOR_VERSION) || \
     (REG_ESYS_PMC_AR_RELEASE_MINOR_VERSION != MCU_PMC_IPVERSION_AR_RELEASE_MINOR_VERSION) || \
     (REG_ESYS_PMC_AR_RELEASE_REVISION_VERSION != MCU_PMC_IPVERSION_AR_RELEASE_REVISION_VERSION) \
    )
    #error "AutoSar Version Numbers of Reg_eSys_PMC.h and Mcu_PMC_IPVersion.h are different"
#endif
/* Check if source file and Mcu_PMC_IPVersion header file are of the same Software version */
#if ((REG_ESYS_PMC_SW_MAJOR_VERSION != MCU_PMC_IPVERSION_SW_MAJOR_VERSION) || \
     (REG_ESYS_PMC_SW_MINOR_VERSION != MCU_PMC_IPVERSION_SW_MINOR_VERSION) || \
     (REG_ESYS_PMC_SW_PATCH_VERSION != MCU_PMC_IPVERSION_SW_PATCH_VERSION) \
    )
    #error "Software Version Numbers of Reg_eSys_PMC.h and Mcu_PMC_IPVersion.h are different"
#endif

/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/


/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/

/***************************************************************************************************/
/***                                        PMC Registers                                        ***/
/***************************************************************************************************/
#if (IPV_PMC == IPV_PMC_01_00_02_05)
    /* Configuration Register (PMC_MCR). */
    #define PMC_MCR_ADDR32                     ((uint32)(PMC_BASEADDR + (uint32)0x00000000U))
    /* Trimming Register (PMC_TRIMR). */
    #define PMC_TRIMR_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x00000004U))
    /* Status Register (PMC_SR). */
    #define PMC_SR_ADDR32                      ((uint32)(PMC_BASEADDR + (uint32)0x00000008U))
#endif

#if (IPV_PMC == IPV_PMC_03_00_01_00)
    /* PMC - Supply Status Register. */
    #define PMC_LVDSC1_ADDR8                   ((uint8)(PMC_BASEADDR + (uint8)0x00U))
    /* PMC - Control Register. */
    #define PMC_LVDSC2_ADDR8                   ((uint8)(PMC_BASEADDR + (uint8)0x01U))
    /* PMC - Regulator Status and Control Register. */
    #define PMC_REGSC_ADDR8                    ((uint8)(PMC_BASEADDR + (uint8)0x02U))
    /* PMC - Low Power Oscillator Trim Register 8 bits. */
    #define PMC_LPOTRIM_ADDR8                  ((uint8)(PMC_BASEADDR + (uint8)0x04U))
    /* PMC - Low Power Oscillator Trim Register 32 bits */
    #define PMC_LPOTRIM_ADDR32                 ((uint32)(PMC_BASEADDR + (uint32)0x00000004U))    
#endif

