marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcu_TS_T40D2M10I1R0/include/Reg_eSys_PMC.h
    #define PMC_REE_TD_TEMP1_2_MASK32                   ((uint32)0x00000010U)
    #define PMC_REE_TD_TEMP1_0_MASK32                   ((uint32)0x00000008U)
    #define PMC_REE_TD_TEMP0_2_MASK32                   ((uint32)0x00000002U)
    #define PMC_REE_TD_TEMP0_0_MASK32                   ((uint32)0x00000001U)

    /***              PMC_RES_TD              ***/
    #define PMC_RES_TD_RWBITS_MASK32                    ((uint32)0x0000001BU)
    #define PMC_RES_TD_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_RES_TD_TEMP1_2_MASK32                   ((uint32)0x00000010U)
    #define PMC_RES_TD_TEMP1_0_MASK32                   ((uint32)0x00000008U)
    #define PMC_RES_TD_TEMP0_2_MASK32                   ((uint32)0x00000002U)
    #define PMC_RES_TD_TEMP0_0_MASK32                   ((uint32)0x00000001U)

    /***              PMC_CTL_TD              ***/
    #define PMC_CTL_TD_RWBITS_MASK32                    ((uint32)0x00000101U)
    #define PMC_CTL_TD_RESBITS_MASK32                   ((uint32)0x00000202U)

    #define PMC_CTL_TD_TS1_EN_MASK32                    ((uint32)0x00000100U)
    #define PMC_CTL_TD_TS0_EN_MASK32                    ((uint32)0x00000001U)

    /***             PMC_TS_FIR              ***/
    #define PMC_TS_FIR_TSNS_FAULT_MASK32                ((uint32)0x00000001U)

    /***         PMC_SELF_TEST_UM_VD_REG              ***/
    #define PMC_SELF_TEST_UM_VD_REG_RWBITS_MASK32       ((uint32)0x000200FFU)
    #define PMC_SELF_TEST_UM_VD_REG_RESBITS_MASK32      ((uint32)0x00000000U)

    #define PMC_SELF_TEST_UM_VD_REG_ST_RESULT_MASK32    ((uint32)0x00020000U)
    #define PMC_SELF_TEST_UM_VD_REG_ST_DONE_MASK32      ((uint32)0x00010000U)
    #define PMC_SELF_TEST_UM_VD_REG_ST_MODE_MASK32      ((uint32)0x000000C0U)
    #define PMC_SELF_TEST_UM_VD_REG_VD_ST_CTRL_MASK32   ((uint32)0x0000003FU)
        
    /***              PMC_FIR              ***/
    #define PMC_FIR_STEST_FAULT_MASK32                  ((uint32)0x00000008U)
    #define PMC_FIR_HVD_FAULT_MASK32                    ((uint32)0x00000002U)
    #define PMC_FIR_LVD_FAULT_MASK32                    ((uint32)0x00000001U)

    /***            PMC_LVD_HVD_INTR_ENB              ***/
    #define PMC_LVD_HVD_INTR_ENB_RWBITS_MASK32          ((uint32)0x8000002DU)
    #define PMC_LVD_HVD_INTR_ENB_RWBITS_USR_MASK32      ((uint32)0x0000002DU)
    #define PMC_LVD_HVD_INTR_ENB_RESBITS_MASK32         ((uint32)0x00000000U)

    #define PMC_LVD_HVD_INTR_ENB_PMC_ENABLE_MASK32      ((uint32)0x80000000U)
    #define PMC_LVD_HVD_INTR_ENB_HVD_FLASH_MASK32       ((uint32)0x00000020U)
    #define PMC_LVD_HVD_INTR_ENB_HVD_HV_MASK32          ((uint32)0x00000008U)
    #define PMC_LVD_HVD_INTR_ENB_HVD_CORE_MASK32        ((uint32)0x00000004U)
    #define PMC_LVD_HVD_INTR_ENB_LVD_CORE_COLD_MASK32   ((uint32)0x00000001U)

    /***          PMC_LVD_HVD_EVENT_STATUS              ***/
    #define PMC_LVD_HVD_EVENT_STATUS_RWBITS_MASK32      ((uint32)0x0000002DU)
    #define PMC_LVD_HVD_EVENT_STATUS_RESBITS_MASK32     ((uint32)0x00000000U)

    #define PMC_LVD_HVD_EVENT_HVD_FLASH_MASK32          ((uint32)0x00000020U)
    #define PMC_LVD_HVD_EVENT_HVD_HV_MASK32             ((uint32)0x00000008U)
    #define PMC_LVD_HVD_EVENT_HVD_CORE_MASK32           ((uint32)0x00000004U)
    #define PMC_LVD_HVD_EVENT_LVD_CORE_COLD_MASK32      ((uint32)0x00000001U)

    /***                   PMC_ADC_CS              ***/
    #define PMC_ADC_CS_RWBITS_MASK32                    ((uint32)0x0000033FU)
    #define PMC_ADC_CS_RESBITS_MASK32                   ((uint32)0x00000000U)

    #define PMC_ADC_CS_STND_BY_RAM_BO_CLR_MASK32        ((uint32)0x00000200U)
    #define PMC_ADC_CS_STND_BY_RAM_BR_DETCT_MASK32      ((uint32)0x00000100U)
    #define PMC_ADC_CS_ADC_CS_MASK32                    ((uint32)0x0000003FU)

    /***              PMC_REE              ***/
    #define PMC_REE_RWBITS_MASK32                       ((uint32)0x0000002DU)
    #define PMC_REE_RESBITS_MASK32                      ((uint32)0x000000D2U)
                                                        
    #define PMC_REE_HVD_FLASH_MASK32                    ((uint32)0x00000020U)
    #define PMC_REE_HVD_HV_MASK32                       ((uint32)0x00000008U)
    #define PMC_REE_HVD_CORE_MASK32                     ((uint32)0x00000004U)
    #define PMC_REE_LVD_CORE_COLD_MASK32                ((uint32)0x00000001U)
#endif


/*==================================================================================================
*                                             ENUMS
==================================================================================================*/


/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/



#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_PMC_H */

/** @} */
